MockServer/req.xml

<?xml version="1.0" encoding="UTF-8"?> <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"> <s:Header> <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://SIBS.WebService.OutBound/SWE/IAberturasContaWS/ObterPoderesRepresentacaoEmpresa</Action> <AxisValues xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:/microsoft/multichannelframework/"> <User>SIB6USR</User> <Solution>SPAC</Solution> </AxisValues> <Validation xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:/microsoft/multichannelframework/"> <username>SIB6USR</username> <password>1234567</password> <Security>true</Security> </Validation> <HeaderContexto xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://SIBS.WebService.OutBound/SWE"> <Operativa>20</Operativa> <Banco>0033</Banco> <CodigoSerie>2402</CodigoSerie> <Operador>X430220</Operador> <NumRemessa>411180</NumRemessa> <UltimoIDOperacao>7066a2c5-a31a-4ebf-b6f2-7af95d5aed9a</UltimoIDOperacao> </HeaderContexto> </s:Header> <s:Body> <ObterPoderesRepresentacaoEmpresaRequestMessage xmlns="http://SIBS.WebService.OutBound/SWE"> <HeaderData xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d4p2="http://SIBS.WebService.OutBound/SWE/BCP" i:type="d4p2:HeaderDataBCP"> <IDOperacao>3d52e4fb-ceb6-42a7-87c8-ad126caf8a58</IDOperacao> <DataHoraOperacao>2025-06-24T18:10:11.6557319+01:00</DataHoraOperacao> <Ambito>AB</Ambito> <CategoriaProcesso>E</CategoriaProcesso> <d4p2:userID>SIB6USR</d4p2:userID> <d4p2:requestApplicationCode>15400</d4p2:requestApplicationCode> <d4p2:countryCode>pt</d4p2:countryCode> <d4p2:bankNumber>0033</d4p2:bankNumber> <d4p2:XNUC>X430220</d4p2:XNUC> </HeaderData> <RequestData xmlns:i="http://www.w3.org/2001/XMLSchema-instance"> <NumeroCliente>564921</NumeroCliente> </RequestData> </ObterPoderesRepresentacaoEmpresaRequestMessage> </s:Body> </s:Envelope>